[
    [
        "Data Analyst / Data Engineer (must be strong technically in SQL & python and Azure etc) required by a leading Milton Keynes based software house. Working hybrid (2 days in Central Milton Keynes) and closely with Marketing, this role sits within the data analytics and engineering team. We are looking for various engineers to join the team with roles ranging from £70-120k plus package.Strong in SQL & Python and experience of working with marketing analytics tools is key as is someone who loves problem solving and has a vision / desire to help create a best-in-class analytics team. Day to day will include -** deliver compelling insights to influence decision and roadmaps** Analytically tackle problems and deliver robust modelling** Visual storytelling** shape sophisticated datasets** apply creative thinking and mentor others.",
        {
            "entities": [
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "python",
                    "HARD"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "Python",
                    "HARD"
                ],
                [
                    "marketing analytics tools",
                    "SOFT"
                ],
                [
                    "problem solving",
                    "SOFT"
                ],
                [
                    "creative thinking",
                    "SOFT"
                ],
                [
                    "mentor",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Flexible hybrid working, pension, bonus and much more on offer.",
        {
            "entities": [
                [
                    "hybrid working",
                    "PERK"
                ],
                [
                    "pension",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "To deliver site-based maintenance at the advertised location, and to participate in a call out rota. Full UK driving license required.",
        {
            "entities": [["Full UK driving license","SOFT"]]
        }
    ],
    [
        "Ensure that routine PPM (to SFG 20) is carried out to all mechanical and electrical plant in accordance with Site task schedules and asset lists.",
        {
            "entities": []
        }
    ],
    [
        "Ensure that reactive tasks throughout the building are completed and be proactive in highlighting areas where improvements can be made. These reactive calls to also include concessionary stores and fabric related items.",
        {
            "entities": []
        }
    ],
    [
        "Ensure that plant faults and defects are swiftly remedied to maintain plant in serviceable order at all times.",
        {
            "entities": []
        }
    ],
    [
        "Ensure that suitable spares are available to carry out both maintenance and reactive works. To provide parts lists and estimated timescales to carry out remedial works.",
        {
            "entities": []
        }
    ],
    [
        "Ensure that all relevant paperwork is completed regarding PPM, reactive and breakdown works and that it is passed without delay to the contract administrator.",
        {
            "entities": []
        }
    ],
    [
        "Ensure that Method Statements and Risk Assessments are prepared and used for all tasks undertaken to always ensure safe working practices.",
        {
            "entities": []
        }
    ],
    [
        "To develop a good working relationship with all members of CBRE staff, subcontractors, and the client representatives.",
        {
            "entities": []
        }
    ],
    [
        "Ensure the provision of a Safe and Healthy working environment. To always include the wearing of uniform and PPE.",
        {
            "entities": []
        }
    ],
    [
        "Ensure the professional image of CBRE Managed Services is always presented.",
        {
            "entities": []
        }
    ],
    [
        "Ensure up to date shift logs are always kept.",
        {
            "entities": []
        }
    ],
    [
        "Ensure that all plant rooms under the responsibility of CBRE Managed services are always locked and are kept in a clean and tidy condition.",
        {
            "entities": []
        }
    ],
    [
        "Supervising and monitoring of sub-contractors works whilst they are on site undertaking maintenance.",
        {
            "entities": []
        }
    ],
    [
        "To arrange and provide holiday and sickness cover at short notice and be flexible in their working patterns.",
        {
            "entities": []
        }
    ],
    [
        "To undertake lone working when and where required, subject to passing satisfactory training.",
        {
            "entities": []
        }
    ],
    [
        "Ensure assigned tasks are actioned and completed as appropriate.",
        {
            "entities": []
        }
    ],
    [
        "To ensure tasks as directed are completed with the appropriate H&S awareness/implementation.",
        {
            "entities": []
        }
    ],
    [
        "Ensure an awareness and compliance to the contractual KPI's/SLA's.",
        {
            "entities": []
        }
    ],
    [
        "Ensure Computer Based Maintenance system, SI LOCAL, is kept up to date and that PPM and reactive tickets are closed out with accurate data captured.",
        {
            "entities": []
        }
    ],
    [
        "To operate a Permit to Work System in accordance with CBRE Quality, Health & Safety procedures and client requirements.",
        {
            "entities": []
        }
    ],
    [
        "To provide holiday and emergency cover as required, at sites not normally covered.",
        {
            "entities": []
        }
    ],
    [
        "Any other task as directed by the account management team.",
        {
            "entities": []
        }
    ],
    [
        "Committed to the delivery of excellent customer service.",
        {
            "entities": [
                [
                    "customer service",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Calm manner, able to work under pressure.",
        {
            "entities": []
        }
    ],
    [
        "Able to make sound decisions when needed.",
        {
            "entities": []
        }
    ],
    [
        "Physically fit and able to carry tools and components by hand up to 20kg.",
        {
            "entities": []
        }
    ],
    [
        "Able to ascend and descend vertical access equipment. Able to work at heights.",
        {
            "entities": []
        }
    ],
    [
        "A team player, able to work with CBRE Managed Services and Client representatives at all levels.",
        {
            "entities": []
        }
    ],
    [
        "Good PC skills",
        {
            "entities": [
                [
                    "PC skills",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Good all round knowledge of general building works, diagnostic and repair procedures, working knowledge of building services systems and maintenance schedules.",
        {
            "entities": []
        }
    ],
    [
        "Formally trained in electrical/mechanical Maintenance.",
        {
            "entities": []
        }
    ],
    [
        "BMS Knowledge.",
        {
            "entities": [
                [
                    "BMS",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Mechanical and commissioning experience.",
        {
            "entities": []
        }
    ],
    [
        "Recognised Health and Safety Qualification, such as IOSH.",
        {
            "entities": [
                [
                    "IOSH",
                    "CERT"
                ]
            ]
        }
    ],
    [
        "Engineers must also understand the demarcation between maintainable assets and BPL maintained assets within laboratory and production environments.",
        {
            "entities": []
        }
    ],
    [
        "Experience of maintaining all relevant mechanical and electrical equipment to clearly defined criteria.",
        {
            "entities": []
        }
    ],
    [
        "Good all round knowledge of general building works, diagnostic and repair procedures.",
        {
            "entities": []
        }
    ],
    [
        "Working knowledge of building services systems and maintenance schedules.",
        {
            "entities": []
        }
    ],
    [
        "Good verbal communication skills.",
        {
            "entities": [
                [
                    "verbal communication",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Good written English skills.",
        {
            "entities": [
                [
                    "written English",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Must be willing to provide holiday and sickness cover at short notice and be flexible in their working patterns.",
        {
            "entities": []
        }
    ],
    [
        "Must have full UK driving license.",
        {
            "entities": [["full UK driving license","SOFT"]]
        }
    ],
    [
        "We are currently looking for an Azure Data Engineer who is seeking an exciting opportunity in a prominent company that is operating at a high level in the Real Estate industry. This company are a leader in their field and upon joining the company you will play a pivotal role advancing the data platform to new heights.",
        {
            "entities": [
            ]
        }
    ],
    [
        "IMPORTANT TO NOTE:",
        {
            "entities": []
        }
    ],
    [
        "This company are not able to offer sponsorship ",
        {
            "entities": []
        }
    ],
    [
        "This role is FULLY onsite in London for the firts 3 MONTHS. ",
        {
            "entities": []
        }
    ],
    [
        "Benefits to you:",
        {
            "entities": []
        }
    ],
    [
        "If you're a Data Engineer with strong SQL coding skills, and a background in Azure who is passionate about driving innovation and want to be part of a dynamic team pushing the boundaries of technology, we would love to hear from you.",
        {
            "entities": [
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "Azure",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Competitive salary 💰",
        {
            "entities": []
        }
    ],
    [
        "Team colloboration and socials ",
        {
            "entities": []
        }
    ],
    [
        "Remote working options 🏠 (after 3 months)",
        {
            "entities": [
                [
                    "Remote working options",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Growth and development opportunities 🌱",
        {
            "entities": [["Growth and development opportunities","PERK"]]
        }
    ],
    [
        "Out client, an Aerospace and Defence contractor is looking for a Cable Design Engineer to join them on a contract basis at their site in Stevenage.",
        {
            "entities": []
        }
    ],
    [
        "Responsibilities:",
        {
            "entities": []
        }
    ],
    [
        "Skillset/experience required:",
        {
            "entities": []
        }
    ],
    [
        "6-month initial contract, potential to extend.",
        {
            "entities": []
        }
    ],
    [
        "Hybrid working, 1-2 days a week onsite in Stevenage.",
        {
            "entities": [
                [
                    "Hybrid working",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "£38.95 p/h Umbrella, inside IR35",
        {
            "entities": []
        }
    ],
    [
        "Carrying out investigations into a full range of cable problems, issues or developments and developing and preparing solutions, individually or as a member of a project team.",
        {
            "entities": []
        }
    ],
    [
        "Liaison with manufacturing to resolve manufacturing problems and defects, plus support to functional and environmental trials.",
        {
            "entities": []
        }
    ],
    [
        "Cable/Harness design",
        {
            "entities": []
        }
    ],
    [
        "Experience on HarnWare, E3 or similar CAD package advantageous.",
        {
            "entities": [
                [
                    "HarnWare",
                    "SOFT"
                ],
                [
                    "E3",
                    "SOFT"
                ],
                [
                    "CAD package",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Product life cycle awareness",
        {
            "entities": []
        }
    ],
    [
        "An understanding of Military Defence Standards and cable harness Manufacture (IPC-WHMA-A-620C). D38999 connector understanding.",
        {
            "entities": []
        }
    ],
    [
        "Understanding / experience of flexible circuits",
        {
            "entities": []
        }
    ],
    [
        "Work effectively in collaboration with mechanical, electronic designers and project managers",
        {
            "entities": []
        }
    ],
    [
        "An appreciation of Interconnect production/process engineering",
        {
            "entities": []
        }
    ],
    [
        "About Autoglass® and Laddaw®",
        {
            "entities": []
        }
    ],
    [
        "We’re a recognised super brand and we know where we’re going. We’re a business with direction and purpose and regardless of your role here, it’s about us all making a difference with real care. We never stand still. We’re relentless, innovative and ambitious, always looking to go further and improve, which creates a world where we need genuine and driven people to help us get there.",
        {
            "entities": []
        }
    ],
    [
        "Making a Difference Together",
        {
            "entities": []
        }
    ],
    [
        "As a truly people focused business, we believe in promoting opportunities for all, welcoming people who share our passion for enabling exceptional customer experience. We’ll support you with fantastic tools and training in an atmosphere that encourages idea contribution and collaboration working with warm, friendly and real people. If this sounds like somewhere you’ll thrive, keep reading.",
        {
            "entities": []
        }
    ],
    [
        "Role: Data Engineer",
        {
            "entities": []
        }
    ],
    [
        "Compensation: Competitive Salary, generous bonus scheme, up to 10% employer contributed workplace pension plus much more...",
        {
            "entities": [["generous bonus scheme","PERK"],["up to 10% employer contributed workplace pension","PERK"]]
        }
    ],
    [
        "Location: Commutable distance to our Bedford offices as this is a hybrid role.",
        {
            "entities": []
        }
    ],
    [
        "We are transforming our business through improved processes, flexible ways of working and a greater use of technology to make a difference to our customers and our people. We are developing super-talented people in our business to be the best; we want to create a great place to work and grow a business we are committed to and feel proud of. We are committed to doing the right things and doing them right; we care about our impact on the environment and are driven on giving back to society. We are determined to keep our business performance health to enable prosperity for all of us.",
        {
            "entities": []
        }
    ],
    [
        "This role and the role holder are integral to our success.",
        {
            "entities": []
        }
    ],
    [
        "The part you’ll play in achieving our transformation will be:",
        {
            "entities": []
        }
    ],
    [
        "Your key responsibilities will be to:",
        {
            "entities": []
        }
    ],
    [
        "Skills, Experience and Qualifications",
        {
            "entities": []
        }
    ],
    [
        "The ideal candidate will have relevant experience in ingesting, transforming and supporting data processes within Snowflakes ecosystem.",
        {
            "entities": [
                [
                    "Snowflakes",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Essential Skills and Experience:",
        {
            "entities": []
        }
    ],
    [
        "Desirable",
        {
            "entities": []
        }
    ],
    [
        "Scale of the role",
        {
            "entities": []
        }
    ],
    [
        "As part of Belron UK and a newly created department, our ambition is to develop a data enabled business for the future. The role holder will be responsible for establishing best practice with the scale and maturity of the organisation and developing a culture of continuous improvement to transform the business production, use and management of Data & BI to enable business growth.",
        {
            "entities": []
        }
    ],
    [
        "Key stakeholders",
        {
            "entities": []
        }
    ],
    [
        "Our Customers, Our People, Society and Financial (fit for growth) are our key stakeholders as a business. The specific key stakeholders for this role are:",
        {
            "entities": []
        }
    ],
    [
        "If you think you fit the bill, then please apply now! We look forward to hearing form you!",
        {
            "entities": []
        }
    ],
    [
        "Accessibility:We make every effort to make our web presenceaccessible to all. Upon request and consistent with applicable laws, we’ll provide reasonable accommodations to individuals who need assistance in the application/hiring process.",
        {
            "entities": []
        }
    ],
    [
        "Responsibility for developing accurate, efficient data transformations which meet customer needs to agreed timescales",
        {
            "entities": [
                [
                    "data transformations",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Ensuring the stability, robustness, and resilience of the projects you design and build, enjoying substantial autonomy while working within agreed standards",
        {
            "entities": []
        }
    ],
    [
        "Align activities to the Group wide data transformation programme both current future orientated",
        {
            "entities": []
        }
    ],
    [
        "Design and build of reliable, robust, and accurate data pipelines based on agreed best practices",
        {
            "entities": []
        }
    ],
    [
        "Transformation of source data to meet business requirements",
        {
            "entities": []
        }
    ],
    [
        "Support the team in consolidating manual processes into a managed data environment",
        {
            "entities": []
        }
    ],
    [
        "Work with key stakeholders and other data consumers to gather requirements",
        {
            "entities": []
        }
    ],
    [
        "Ad-hoc support on database administration tasks as needed",
        {
            "entities": []
        }
    ],
    [
        "Understanding of Snowflake architecture, data modelling and administration",
        {
            "entities": [
                [
                    "Snowflake",
                    "HARD"
                ],
                [
                    "data modelling",
                    "SOFT"
                ],
                [
                    "administration",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Experience in designing and implementing efficient ETL/ELT pipelines",
        {
            "entities": [
                [
                    "ETL",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Experience with AWS Data Services - AWS S3",
        {
            "entities": [
                [
                    "AWS",
                    "HARD"
                ],
                [
                    "AWS S3",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Comfortable working with a range of data sources and formats e.g. JSON, XML, Flat files, API Integration",
        {
            "entities": [
                [
                    "JSON",
                    "HARD"
                ],
                [
                    "XML",
                    "HARD"
                ],
                [
                    "Flat files","HARD"
                ],
                [
                    "API Integration",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Understanding of dimensional modelling for Data Warehousing (Kimball)",
        {
            "entities": [
                [
                    "dimensional modelling",
                    "SOFT"
                ],
                [
                    "Data Warehousing",
                    "SOFT"
                ],
                ["Kimball","HARD"]
            ]
        }
    ],
    [
        "Proficient in writing SQL, Stored procedures and views. Creating and optimising complex queries, analysing query performance, use of partitioning and clustering.",
        {
            "entities": [
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "analysing query",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Experience in effectively coaching novice developers",
        {
            "entities": []
        }
    ],
    [
        "Good problem solving and data analysis skills",
        {
            "entities": [
                [
                    "problem solving",
                    "SOFT"
                ],
                [
                    "data analysis",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Excellent written and oral communication skills, ability to communicate complex concepts",
        {
            "entities": [
                [
                    "written",
                    "SOFT"
                ],
                [
                    "communication",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Ability to translate business requirements into technical solutions",
        {
            "entities": []
        }
    ],
    [
        "Experience with other databases MS SQL Server, Oracle",
        {
            "entities": [
                [
                    "databases",
                    "SOFT"
                ],
                [
                    "SQL Server",
                    "HARD"
                ],
                [
                    "Oracle",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Experience using Informatica",
        {
            "entities": [
                [
                    "Informatica",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Python",
        {
            "entities": [
                [
                    "Python",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Understanding of Data Lakes",
        {
            "entities": [
                [
                    "Data Lakes",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Familiar with Jira, Confluence",
        {
            "entities": [
                [
                    "Jira",
                    "HARD"
                ],
                [
                    "Confluence",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Data Engineering Manager",
        {
            "entities": []
        }
    ],
    [
        "Insight & Analytics",
        {
            "entities": []
        }
    ],
    [
        "Data Led Decisions Programme",
        {
            "entities": []
        }
    ],
    [
        "Data Engineer, Workforce Intelligence PXT-Talent",
        {
            "entities": []
        }
    ],
    [
        "Amazon’s mission is to be the most customer centric company in the world. The Workforce Staffing organization is on the front line of that mission by hiring the hourly fulfilment associates who make that mission a reality. To drive the necessary growth and continued scale of Amazon’s associate needs within a constrained employment environment, Amazon is creating a Workforce Staffing Analytics program.",
        {
            "entities": []
        }
    ],
    [
        "This program re-invents how Amazon attracts, communicates with, and ultimately hires its hourly associates. This team own multi-layered research and program implementations to drive deep learnings, process improvements, and strategic recommendations to global leadership. Are you passionate about data? Do you enjoy questioning the status quo? Do complex and difficult challenges excite you? If yes, this may be the team for you.",
        {
            "entities": []
        }
    ],
    [
        "As a Data Engineer, you should be an expert in the architecture of data solutions for the Enterprise using multiple platforms. You should excel in the design, creation, management, and business use of extremely large data sets. You should have excellent business and communication skills to be able to work with business analysts and engineers to determine how best to design the data warehouse for reporting and analytics. You will be responsible for designing and implementing scalable ETL processes in the data platform to support the rapidly growing and dynamic business demand for data, and use it to deliver the data as service which will have an immediate influence on day-to-day decision making. You should have the ability to develop and tune SQL to provide optimized solutions to the business.",
        {
            "entities": [
                [
                    "data solutions",
                    "SOFT"
                ],
                [
                    "communication",
                    "SOFT"
                ],
                [
                    "ETL",
                    "SOFT"
                ],
                [
                    "SQL",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Basic qualifications",
        {
            "entities": []
        }
    ],
    [
        "Preferred qualifications",
        {
            "entities": []
        }
    ],
    [
        "Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon.",
        {
            "entities": []
        }
    ],
    [
        "3+ years of data engineering experience",
        {
            "entities": []
        }
    ],
    [
        "Experience with big data technologies such as: Hadoop, Hive, Spark, EMR",
        {
            "entities": [
                [
                    "big data",
                    "SOFT"
                ],
                [
                    "Hadoop",
                    "HARD"
                ],
                [
                    "Hive",
                    "HARD"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "EMR",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Experience with SQL",
        {
            "entities": [
                [
                    "SQL",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS",
        {
            "entities": [
                [
                    "scripting",
                    "SOFT"
                ],
                [
                    "Python",
                    "HARD"
                ],
                [
                    "Java",
                    "HARD"
                ],
                [
                    "Scala",
                    "HARD"
                ],
                [
                    "NodeJS",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Experience with data modeling, warehousing and building ETL pipelines",
        {
            "entities": [
                [
                    "data modeling",
                    "SOFT"
                ],
                [
                    "ETL",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Experience in tuning performance in big data / distributed systems",
        {
            "entities": [
                [
                    "tuning performance",
                    "SOFT"
                ],
                [
                    "big data",
                    "SOFT"
                ],
                [
                    "distributed systems",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Bachelor's Degree in Computer Science, Engineering, Mathematics, or a related field",
        {
            "entities": [
                [
                    "Computer Science",
                    "CERT"
                ],
                [
                    "Engineering",
                    "CERT"
                ],
                [
                    "Mathematics",
                    "CERT"
                ]
            ]
        }
    ],
    [
        "Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions",
        {
            "entities": [
                [
                    "AWS",
                    "HARD"
                ],
                [
                    "Redshift",
                    "HARD"
                ],
                [
                    "S3",
                    "HARD"
                ],
                [
                    "AWS Glue",
                    "HARD"
                ],
                [
                    "EMR",
                    "HARD"
                ],
                [
                    "Kinesis",
                    "HARD"
                ],
                [
                    "FireHose",
                    "HARD"
                ],
                [
                    "Lambda",
                    "HARD"
                ],
                [
                    "IAM",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)",
        {
            "entities": [
                [
                    "non-relational databases",
                    "SOFT"
                ],
                [
                    "data stores",
                    "SOFT"
                ],
                [
                    "object storage",
                    "SOFT"
                ],
                [
                    "graph databases",
                    "SOFT"
                ],
                [
                    "column-family databases",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Knowledge of professional software engineering & best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence",
        {
            "entities": [
                [
                    "coding standards",
                    "SOFT"
                ],
                [
                    "software architectures",
                    "SOFT"
                ],
                [
                    "code reviews",
                    "SOFT"
                ],
                [
                    "source control management",
                    "SOFT"
                ],
                ["source control management","SOFT"],
                ["continuous deployments","SOFT"],
                ["testing","SOFT"],
                ["operational excellence","SOFT"]
            ]
        }
    ],
    [
        "Experience with Lakehouse formats, such as Apache Iceberg, Delta lake, Apache Hudi.",
        {
            "entities": [
                [
                    "Lakehouse",
                    "SOFT"
                ],
                [
                    "Apache Iceberg",
                    "HARD"
                ],
                [
                    "Delta lake",
                    "HARD"
                ],
                [
                    "Apache Hudi",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Ecommerce / E-Commerce Data Analyst / Data Engineer / SQL / Python",
        {
            "entities": [
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "Python",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "This Role",
        {
            "entities": []
        }
    ],
    [
        "This is an excellent opportunity to join us on our fast-growth journey! We're looking for a superb Data candidate to join our team in this newly created role to super-charge our growth by helping the team make reliable data driven decisions. You must have experience working within Ecommerce.",
        {
            "entities": [
                [
                    "Ecommerce",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "You'll help implement split tests and analyse the data to determine what works and what doesn't, what helps and what hinders conversions. You'll be given a high level of autonomy and your work will have a real impact on the performance of the company.",
        {
            "entities": []
        }
    ],
    [
        "Your responsibilities will include:",
        {
            "entities": []
        }
    ],
    [
        "You'll excel in this role if you have the following skills & experience:",
        {
            "entities": []
        }
    ],
    [
        "Benefits:",
        {
            "entities": []
        }
    ],
    [
        "Work to uncover trends in the data, building models to predict sales.",
        {
            "entities": []
        }
    ],
    [
        "Create dashboards and visual reports for reporting to the team and management.",
        {
            "entities": []
        }
    ],
    [
        "Work with our developers to devise algorithms for testing and production.",
        {
            "entities": []
        }
    ],
    [
        "Developing and maintaining marketing data infrastructure",
        {
            "entities": []
        }
    ],
    [
        "Collaborating with our design and development team, together with other stakeholders, to help drive the user experience on our website and soon, mobile app.",
        {
            "entities": []
        }
    ],
    [
        "Leading weekly conversion optimisation strategy meetings with management",
        {
            "entities": []
        }
    ],
    [
        "Formulating ideas and hypothesis to keep our testing roadmap full.",
        {
            "entities": []
        }
    ],
    [
        "Interpreting raw data test results, turn them into insights and presenting those finding to senior management.",
        {
            "entities": []
        }
    ],
    [
        "Comfortable working with large data sets.",
        {
            "entities": []
        }
    ],
    [
        "Ecommerce sector experience required",
        {
            "entities": []
        }
    ],
    [
        "demonstrable ability to interpret complex data easily, summarising it in easy-to-understand learnings for your colleagues and management",
        {
            "entities": []
        }
    ],
    [
        "SQL, Python experience would be necessary.",
        {
            "entities": [
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "Python",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Free breakfast every morning",
        {
            "entities": [["Free breakfast every morning","PERK]"]]
        }
    ],
    [
        "Minimum of 25 days holiday per year as standard (plus more the longer you stay)",
        {
            "entities": [
                [
                    "25 days holiday per year",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Flexible hours",
        {
            "entities": [
                [
                    "Flexible hours",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Your birthday off work",
        {
            "entities": [
                [
                    "birthday off work",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Free EV charging",
        {
            "entities": [
                [
                    "Free EV charging",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Free car washing",
        {
            "entities": [
                [
                    "Free car washing",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Regular team and charity fundraising events",
        {
            "entities": []
        }
    ],
    [
        "Generous staff discount",
        {
            "entities": [["Generous staff discount","PERK"]]
        }
    ],
    [
        "Company pension",
        {
            "entities": [
                [
                    "Company pension",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Data Engineer (Synapse, ETL, Azure, SQL, CI/CD, Spark) - £50k - £60k - Hybrid  Data Engineer (Synapse, ETL, Azure, SQL, CI/CD, Spark) - £50k - £60k - Hybrid   I am partnered with one of the UK's leading real estate organisations and due to a lot of recent success in the market, they are looking to expand across their engineering function and are looking to connect with Data Engineers (ETL, Azure, SQL, CI/CD, Spark) to help move their legacy databases to the cloud.  As a business they are offering flexible hybrid working and ask that the engineering teams are in the office twice a week.  As they expand, the Data Engineer (ETL, Azure, SQL, CI/CD, Spark) will be responsible for building scalable pipelines for now and the future to help cleanse data from several sources. The Data Engineers (ETL, Azure, SQL, CI/CD, Spark) will work hand in hand with the software engineering team and architects to ensure that data delivery is clean and consistent through the transformation.   Skill set required",
        {
            "entities": [
                [
                    "Synapse",
                    "HARD"
                ],
                [
                    "ETL",
                    "HARD"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "Synapse",
                    "HARD"
                ],
                [
                    "ETL",
                    "HARD"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "ETL",
                    "SOFT"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "hybrid working",
                    "PERK"
                ],
                [
                    "ETL",
                    "SOFT"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "pipelines",
                    "SOFT"
                ],
                [
                    "ETL",
                    "SOFT"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ]
            ]
        }
    ],
    [
        " If you are a Data Engineer (ETL, Azure, SQL, CI/CD, Spark) and the above sounds like you, then please click on the apply button below.  Data Engineer (Synapse, ETL, Azure, SQL, CI/CD, Spark) - £50k - £60k - Hybrid  Data Engineer (Synapse, ETL, Azure, SQL, CI/CD, Spark) - £50k - £60k - Hybrid",
        {
            "entities": [
                [
                    "ETL",
                    "SOFT"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "Synapse",
                    "HARD"
                ],
                [
                    "ETL",
                    "HARD"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "Synapse",
                    "HARD"
                ],
                [
                    "ETL",
                    "HARD"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "Hybrid",
                    "CERT"
                ]
            ]
        }
    ],
    [
        "Azure",
        {
            "entities": [
                [
                    "Azure",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "ETL",
        {
            "entities": [
                [
                    "ETL",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Data Factory",
        {
            "entities": [
                [
                    "Data Factory",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Synapse",
        {
            "entities": [
                [
                    "Synapse",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Data Lakes",
        {
            "entities": [
                [
                    "Data Lakes",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "CI/CD - Azure DevOps",
        {
            "entities": [
                [
                    "CI/CD",
                    "SOFT"
                ],
                [
                    "Azure",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Spark / PySpark",
        {
            "entities": [
                [
                    "Spark",
                    "HARD"
                ],
                [
                    "PySpark",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Cyber Security Engineer | Data Security Engineer Fully Remote Permanent £50,000 - £60,000 ",
        {
            "entities": []
        }
    ],
    [
        "A Cyber / Data Security Engineer is required to join a highly successful, up and coming technology consulting services business to take responsibility for designing, implementing, and maintaining robust data security measures to protect sensitive information for end clients. You will be working closely with cross-functional teams to identify vulnerabilities, develop security solutions, and ensure the integrity, confidentiality, and availability of data. Expertise required in M365, Azure, Microsoft Purview and Sharepoint from a Security perspective. This is a client facing role so strong communication skills are extremely important.",
        {
            "entities": [
                [
                    "M365",
                    "HARD"
                ],
                [
                    "Azure",
                    "HARD"
                ],
                [
                    "Microsoft Purview",
                    "HARD"
                ],
                [
                    "Sharepoint",
                    "HARD"
                ],
                [
                    "communication",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "What the role entails:",
        {
            "entities": []
        }
    ],
    [
        "What we need from you:",
        {
            "entities": []
        }
    ],
    [
        "* Bachelor's degree in computer science, Information Security, or a related field. * Proven experience (5+ years) in data security engineering or a related role, with a focus on implementing and maintaining data security measures. * Strong understanding of data security principles, protocols, and best practices. * Proficiency in security technologies",
        {
            "entities": [
                [
                    "computer science",
                    "CERT"
                ],
                [
                    "Information Security",
                    "CERT"
                ],
                [
                    "data security engineering",
                    "SOFT"
                ],
                [
                    "data security measures",
                    "SOFT"
                ],
                [
                    "data security principles",
                    "SOFT"
                ],
                [
                    "security technologies",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "If you are a seasoned Data Security Engineer that would like to join a technology centric company embarking on a new and exciting journey working with household names, then please hit apply now!",
        {
            "entities": []
        }
    ],
    [
        "An exciting and challenging opportunity has arisen for a Data Centre Engineer to support one of our data centres based in Southall, Middlesex.",
        {
            "entities": []
        }
    ],
    [
        "The successful applicant should be technically competent, have excellent verbal communication skills and be familiar with the data centre environment. ",
        {
            "entities": [
                [
                    "verbal communication",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "This is a permanent full-time position working Monday - Friday, 08:00 - 16:00 and also working as part of the shared on call rota to provide the required 24/7 on-site support.",
        {
            "entities": []
        }
    ],
    [
        "As a Data Centre Engineer you will:",
        {
            "entities": []
        }
    ],
    [
        "What we're looking for:",
        {
            "entities": []
        }
    ],
    [
        "Desirable skills: ",
        {
            "entities": []
        }
    ],
    [
        "This is an excellent opportunity to join us and as an employee you will gain access to a large library of training courses and accreditations to help further your skills and development.",
        {
            "entities": [
                [
                    "training courses",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "As an FDS Employee you will benefit from:",
        {
            "entities": []
        }
    ],
    [
        "Apply now for consideration!",
        {
            "entities": []
        }
    ],
    [
        "By completing the application process you agree that ES Field Delivery UK LTD (FDS) may contact you in line with General Data Protection Regulation (GDPR) in connection with your application via the contact details you provided in relation to the vacancy you have applied for. Our Privacy Notice can be viewed via our website.",
        {
            "entities": []
        }
    ],
    [
        "Plan and implement where new cabinets and free-standing equipment should be installed ",
        {
            "entities": []
        }
    ],
    [
        "Design and manage all structured cabling infrastructure requirements",
        {
            "entities": []
        }
    ],
    [
        "Advise requirements for additional network or storage capability and liaise with the associated support teams",
        {
            "entities": []
        }
    ],
    [
        "Install and configure hardware in the Data Hall",
        {
            "entities": []
        }
    ],
    [
        "Manage the asset register for all equipment installed in the Data Hall",
        {
            "entities": []
        }
    ],
    [
        "Troubleshoot hardware issues reported by Support/Platform Teams",
        {
            "entities": []
        }
    ],
    [
        "Provide local Smart Hands assistance to Support/Platform Teams",
        {
            "entities": []
        }
    ],
    [
        "Escort and supervise maintenance services provided by third party vendors",
        {
            "entities": []
        }
    ],
    [
        "Schedule 3rd party break-fix activities",
        {
            "entities": []
        }
    ],
    [
        "Strong communication skills both verbal and written",
        {
            "entities": [
                [
                    "communication",
                    "SOFT"
                ],
                [
                    "verbal and written",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Ability to work precisely and quality oriented",
        {
            "entities": []
        }
    ],
    [
        "Flexibility and willingness to cope with unexpected problems and situations",
        {
            "entities": []
        }
    ],
    [
        "Capacity to manage customer expectations and interactions effectively",
        {
            "entities": []
        }
    ],
    [
        "Basic understanding of server HW",
        {
            "entities": [
                [
                    "server HW",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Generic media management knowledge",
        {
            "entities": [
                [
                    "media management",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Proficiency in Microsoft Windows, Microsoft Office environment and general PC hardware",
        {
            "entities": [
                [
                    "Microsoft Windows",
                    "HARD"
                ],
                [
                    "Microsoft Office",
                    "HARD"
                ],
                [
                    "PC hardware",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Basic understanding of Networking",
        {
            "entities": [
                [
                    "Networking",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Professional certification in a relative field",
        {
            "entities": [["relative field","CERT"]]
        }
    ],
    [
        "Proven work history in an IT environment ",
        {
            "entities": [
                [
                    "IT environment",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Experience of IT operations in a data centre or similar environment",
        {
            "entities": [
                [
                    "IT operations",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Flexible benefits including, medical insurance and eyecare vouchers",
        {
            "entities": [
                [
                    "medical insurance",
                    "PERK"
                ],
                [
                    "eyecare vouchers",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Company pension scheme",
        {
            "entities": [
                [
                    "Company pension scheme",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "23 days holiday raising to max 25",
        {
            "entities": []
        }
    ],
    [
        "Life insurance",
        {
            "entities": [
                [
                    "Life insurance",
                    "PERK"
                ]
            ]
        }
    ],
    [
        "Employee Assistance Programme",
        {
            "entities": []
        }
    ],
    [
        "Urban Empire Recruitment has partnered with a start-up company that is a disrupter in the insurance industry. In the same way that fintech companies have disrupted the traditional banking sector, reimagining financial platforms for a new generation.",
        {
            "entities": []
        }
    ],
    [
        "My client has developed a flexible insurance that is a mobile-first, frictionless platform which lets people interact with their insurance provider with the same ease, speed and transparency they’re already used to having with providers in other sectors. Customers can pay monthly, instantly make changes to their cover, and bring all their disclosure, payment and claims information together in a single place.",
        {
            "entities": []
        }
    ],
    [
        "This is a fantastic opportunity for you to build something special with a close knit team, we offer lots of progression in a fast paced position where two days are never the same!",
        {
            "entities": []
        }
    ],
    [
        "Responsibilities:",
        {
            "entities": []
        }
    ],
    [
        "Qualifications:",
        {
            "entities": []
        }
    ],
    [
        "You must also have experience using the following software/tools:",
        {
            "entities": []
        }
    ],
    [
        "When you apply for this role a consultant from Urban Empire Recruitment will give you a call if you’re successful.",
        {
            "entities": []
        }
    ],
    [
        "Please note due to the large volume of applications we receive for these roles, if we have not contacted you within 7 days then unfortunately your application hasn't been successful. however, we may contact you regarding other roles. We're sorry we can't contact you directly, but we wish you all the best in your job search",
        {
            "entities": []
        }
    ],
    [
        "Job Title: Data Engineer",
        {
            "entities": []
        }
    ],
    [
        "Salary:£75,000 - £85,000 D.O.E",
        {
            "entities": []
        }
    ],
    [
        "Location: London (Hybrid 3days in the office)",
        {
            "entities": []
        }
    ],
    [
        "Job Type: Full Time, Permanent",
        {
            "entities": []
        }
    ],
    [
        "Develop and sustain an efficient data pipeline architecture that can adapt to the needs of the organisation.",
        {
            "entities": [
                [
                    "data pipeline architecture",
                    "SOFT"
                ]
            ]
        }
    ],
    [
        "Compile extensive, intricate datasets that align with both functional and non-functional business objectives.",
        {
            "entities": []
        }
    ],
    [
        "Devise and execute enhancements to internal workflows by automating manual tasks, refining data distribution methods, and redesigning infrastructure to improve scalability.",
        {
            "entities": []
        }
    ],
    [
        "Construct the necessary framework for effective data extraction, transformation, and loading (ETL), leveraging SQL and AWS-based 'big data' technologies.",
        {
            "entities": [
                [
                    "ETL",
                    "SOFT"
                ],
                [
                    "SQL",
                    "HARD"
                ],
                [
                    "AWS",
                    "HARD"
                ]
            ]
        }
    ],
    [
        "Develop analytics solutions that draw from the data pipeline, offering actionable insights into areas like customer acquisition, operational efficacy, and other vital business performance indicators.",
        {
            "entities": [
                [
                    "data pipeline",
                    "SOFT"
                ]
            ]
        }
    ]
]
